'''
用卦生体卦 大吉
体用比和 吉
体卦克用卦 小吉
体卦生用卦 小凶
用卦克体卦 大凶

先天数
乾1金
兑2金
离3火
震4木
巽5木
坎6水
艮7土
坤8土

上卦乾：1、9、17、25
天、履、同人、无妄、姤、讼、遁、否
其中体用比和的卦有：天、履

天卦：
初爻：姤。体卦乾、用卦巽。木、金，平。
二爻：同人。体卦乾、用卦离。火克金，大凶。
三爻：履。体卦乾、用卦兑。金、金，吉。
四爻：小畜。体卦乾、用卦巽。平。
五爻：大有。大凶。
六爻：夬。吉。

履卦：
初爻：讼。体卦乾、用卦坎。金生水，小凶。
二爻：无妄。用卦震。木、金，平。
三爻：天。吉。
四爻：中孚。体卦兑，用卦巽。木、金，平。
五爻：睽。用卦离。火克金，大凶。
六爻：泽。用卦兑。吉。

上卦震：4、12、20
大壮、归妹、丰、雷、恒、解、小过、豫
其中体用比和的有：雷、恒

雷卦：
初爻：豫。体卦震，用卦坤。木克土，小吉。
二爻：归妹。用卦兑。金克木，大凶。
三爻：丰。用卦离。木生火，小凶。
四爻：复。小吉。
五爻：随。大凶。
六爻：噬嗑。小凶。

恒卦：
初爻：大壮。用卦乾。金克木，大凶。
二爻：小过。用卦艮。木克土，小吉。
三爻：解。用卦坎。水生木，大吉。
四爻：升。体卦巽，用卦坤。木克土，小吉。
五爻：大过。用卦兑。金克木，大凶。
六爻：鼎。用卦离。木生火，小凶。

用卦生体卦：
上卦震，下卦坎。解。
初爻：归妹。大凶。
二爻：豫。小吉。
三爻：恒。吉。


下挂震：
无妄、随、噬嗑、雷、益、屯、颐、复
其中体用比和的有：益

益卦：
初爻：观。体卦巽，用卦坤。木克土，小吉。
二爻：中孚。用卦兑。大凶。
三爻：家人。用卦离。小凶。
四爻：无妄。体卦震，用卦乾。大凶。
五爻：颐。用卦艮。小吉。
六爻：屯。用卦坎，大吉。

用卦生体卦：
屯。
四爻：随。
五爻：复。
六爻：益。吉。

#木生火,火生土,土生金,金生水,水生木
#金克木,木克土,土克水,水克火,火克金
'''
